In [1]:
import numpy as np
from datascience import *
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action="ignore", category=FutureWarning)

In [4]:
sec_in_day = 60*60*24
sec_in_june = sec_in_day * 30
sec_in_period = sec_in_day * 73 + (60*60*21.5)
sec_in_june
sec_in_period

6384600.0

In [5]:
world_population = Table.read_table('world_population.csv')
pop_in_2016 = world_population.take(65)
pop_in_2016

Population
7256490011

In [6]:
population_1950 = world_population.take(0)
population_1950

Population
2557628654

In [8]:
pop_array = world_population.column(0)
change = pop_array[65] - pop_array[0]
growth = change ** (1/66) - 1
growth

0.401345886044538

In [11]:
data = 'https://raw.githubusercontent.com/oikobill/Kaggle/master/Titanic/data/train.csv'
titanic = Table.read_table(data)
titanic = titanic.relabeled('Pclass', 'passenger_class')
siblings = titanic.column(6)
children = titanic.column(7)
famsize = titanic.with_column('family_size',siblings+children)
famsize
youngest = titanic.sort('Age')
youngest
oldest = titanic.sort('Age', descending = True)
oldest

PassengerId | Survived | passenger_class | Name                                         | Sex    | Age  | SibSp | Parch | Ticket     | Fare    | Cabin | Embarked
889         | 0        | 3               | Johnston, Miss. Catherine Helen "Carrie"     | female | nan  | 1     | 2     | W./C. 6607 | 23.45   | nan   | S
879         | 0        | 3               | Laleff, Mr. Kristo                           | male   | nan  | 0     | 0     | 349217     | 7.8958  | nan   | S
869         | 0        | 3               | van Melkebeke, Mr. Philemon                  | male   | nan  | 0     | 0     | 345777     | 9.5     | nan   | S
864         | 0        | 3               | Sage, Miss. Dorothy Edith "Dolly"            | female | nan  | 8     | 2     | CA. 2343   | 69.55   | nan   | S
860         | 0        | 3               | Razi, Mr. Raihed                             | male   | nan  | 0     | 0     | 2629       | 7.2292  | nan   | C
850         | 1        | 1               | Goldenberg, Mrs. Samuel L (Edwiga Grabowska) | female | nan  | 1     | 0     | 17453      | 89.1042 | C92   | C
847         | 0        | 3               | Sage, Mr. Douglas Bullen                     | male   | nan  | 8     | 2     | CA. 2343   | 69.55   | nan   | S
840         | 1        | 1               | Marechal, Mr. Pierre                         | male   | nan  | 0     | 0     | 11774      | 29.7    | C47   | C
838         | 0        | 3               | Sirota, Mr. Maurice                          | male   | nan  | 0     | 0     | 392092     | 8.05    | nan   | S
833         | 0        | 3               | Saad, Mr. Amin                               | male   | nan  | 0     | 0     | 2671       | 7.2292  | nan   | C
... (881 rows omitted)